Catalogs/ИА_Инструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Инструкции</Name>
			<Comment>Должностные инструкции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипИнструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ТипыИнструкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИнструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СтатусИнструкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКолонтитула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВремКаталогаВорд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияГугл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаГуглДок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсемСотрудникам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокТегов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВерсииДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИА_ДоступныеИнструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДоступныеИнструкции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Инструкции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_УровниДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_УровниДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ТипыИнструкций</v8:Type>
						<v8:Type>cfg:EnumRef.ИА_СтатусИнструкции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИА_Инструкции/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	ЕстьКонтрольПоТипамИнструкций = Константы.ИА_ДИ_КонтрольПоТипамИнструкций.Получить();
	ЕстьКонтрольПоСтатусам        = Константы.ИА_ДИ_КонтрольПоСтатусам.Получить();
	ЕстьКонтрольПоСериям          = Константы.ИА_ДИ_КонтрольПоСериям.Получить();
	
	//////////// Обновление доступных инструкций ////////////////
	Набор = РегистрыСведений.ИА_ДоступныеИнструкции.СоздатьНаборЗаписей();
	Набор.Отбор.Инструкция.Значение = Ссылка;
	Набор.Отбор.Инструкция.Использование = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СписокАдминов = Новый СписокЗначений;
	//Админы
	Запрос.Текст = Запрос.Текст + " ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИА_УровниДоступаПользователей.Пользователь, 1 КАК ЕстьДоступ
	|ИЗ
	|	РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
	|ГДЕ
	|	ИА_УровниДоступаПользователей.ОбъектДоступа = &Админ И ИА_УровниДоступаПользователей.Пользователь <> ЗНАЧЕНИЕ(справочник.пользователи.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Админ", Справочники.ОргСхема.ПустаяСсылка());
	ВыборкаПольз = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПольз.Следующий() Цикл
		НовЗап = Набор.Добавить();
		НовЗап.Инструкция = Ссылка;
		НовЗап.Пользователь = ВыборкаПольз.Пользователь;
		
		СписокАдминов.Добавить(ВыборкаПольз.Пользователь);
	КонецЦикла;
	
	
	СписокПольз = Новый СписокЗначений;
	// ПОСТЫ
	Для каждого стр из КодыРаспределения Цикл
		Если стр.КодРаспределения.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИА_УровниДоступаПользователей.Пользователь
		|ИЗ
		|	РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
		|ГДЕ
		|	ИА_УровниДоступаПользователей.ОбъектДоступа = &ОбъектДоступа";
		Запрос.УстановитьПараметр("ОбъектДоступа", стр.КодРаспределения);
		Если стр.ВсемСотрудникам Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "= &ОбъектДоступа", "В ИЕРАРХИИ(&ОбъектДоступа)");
		КонецЕсли;
		
		ВыборкаПольз = Запрос.Выполнить().Выбрать();
		Пока ВыборкаПольз.Следующий() Цикл
			Если СписокПольз.НайтиПоЗначению(ВыборкаПольз.Пользователь) = Неопределено Тогда
				СписокПольз.Добавить(ВыборкаПольз.Пользователь);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	1 КАК Доступно
	|ПОМЕСТИТЬ ДоступПоПостам
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	&Отбор = Ложь ИЛИ Пользователи.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Отбор", КодыРаспределения.Количество()>0);
	Запрос.УстановитьПараметр("Ссылка", СписокПольз);
	Запрос.Выполнить();
	
	// главный запрос
	
	счОтборов = 1;
	ТекстЗапроса = "ВЫБРАТЬ
	|	Подзапрос.Пользователь,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Подзапрос.Доступно) КАК Доступно
	|ИЗ 
	|	
	|    (ВЫБРАТЬ
	|		ДоступПоПостам.Пользователь КАК Пользователь,
	|		1 КАК Доступно
	|	ИЗ
	|		ДоступПоПостам КАК ДоступПоПостам
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДоступПоПостам.Пользователь ";
	Если ЕстьКонтрольПоСериям Тогда
		ТекстЗапроса = ТекстЗапроса+"		   
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИА_УровниДоступаПользователей.Пользователь,
		|		2
		|	ИЗ
		|		РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
		|	ГДЕ
		|		(ИА_УровниДоступаПользователей.ОбъектДоступа В (&Серии)
		|				ИЛИ &ОтборПоСериям = ЛОЖЬ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИА_УровниДоступаПользователей.Пользователь";
		счОтборов = счОтборов + 1;
	КонецЕсли;
	
	Если ЕстьКонтрольПоТипамИнструкций Тогда
		ТекстЗапроса = ТекстЗапроса+"
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИА_УровниДоступаПользователей.Пользователь,
		|		3
		|	ИЗ
		|		РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
		|	ГДЕ
		|		(ИА_УровниДоступаПользователей.ОбъектДоступа = &ТипИснтрукции
		|				ИЛИ &ОтборПоТипу = ЛОЖЬ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИА_УровниДоступаПользователей.Пользователь ";
		счОтборов = счОтборов + 1;
	КонецЕсли;
	
	Если ЕстьКонтрольПоСтатусам Тогда
		ТекстЗапроса = ТекстЗапроса+"
		
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИА_УровниДоступаПользователей.Пользователь,
		|		4
		|	ИЗ
		|		РегистрСведений.ИА_УровниДоступаПользователей КАК ИА_УровниДоступаПользователей
		|	ГДЕ
		|		(ИА_УровниДоступаПользователей.ОбъектДоступа = &Статус
		|				ИЛИ &ОтборПоСтатусу = ЛОЖЬ)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ИА_УровниДоступаПользователей.Пользователь";
		счОтборов = счОтборов + 1;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса+"
	|) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Пользователь
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Подзапрос.Доступно) = &счОтборов";
	
	Запрос.УстановитьПараметр("счОтборов", счОтборов);
	Запрос.Текст = ТекстЗапроса;			
	Если ЕстьКонтрольПоСериям Тогда	
		Запрос.УстановитьПараметр("Серии", Серии.ВыгрузитьКолонку("Серия"));
		Запрос.УстановитьПараметр("ОтборПоСериям", Серии.Количество()>0);
	КонецЕсли;
	
	Если ЕстьКонтрольПоТипамИнструкций Тогда
		Запрос.УстановитьПараметр("ТипИснтрукции", ТипИнструкции);
		Запрос.УстановитьПараметр("ОтборПоТипу", ЗначениеЗаполнено(ТипИнструкции));
	КонецЕсли;
	
	Если ЕстьКонтрольПоСтатусам Тогда
		Запрос.УстановитьПараметр("Статус", Статус);
		Запрос.УстановитьПараметр("ОтборПоСтатусу", ЗначениеЗаполнено(Статус));
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СписокАдминов.НайтиПоЗначению(Выборка.Пользователь) = Неопределено ТОгда
			НовЗап = Набор.Добавить();
			НовЗап.Инструкция = Ссылка;
			НовЗап.Пользователь = Выборка.Пользователь;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
	// обновим теги для поиска
	ИА_Инструкции.ОбновитьТегиПоИнструкции(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		СписокТегов.Очистить();
		
		стр = Теги;
		стр = СтрЗаменить(стр, ".", " ");
		стр = СтрЗаменить(стр, ",", " ");
		стр = СтрЗаменить(стр, "+", " ");
		стр = СтрЗаменить(стр, "-", " ");
		стр = СтрЗаменить(стр, "/", " ");
		
		// уберем двойной пробел
		Пока Найти(Стр,"  ")>0 Цикл
			стр = СтрЗаменить(стр, "  ", " ");
		КонецЦикла;
		
		стр = СтрЗаменить(стр, " ", Символы.ПС);
		
		Для Н = 1 по СтрЧислоСтрок(стр) Цикл
			СписокТегов.Добавить().Тег = ВРЕГ(СтрПолучитьСтроку(Стр, Н));
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
